[PAD]
[UNK]
[START]
[END]
!
"
#
$
%
&
'
(
)
*
+
,
-
.
/
0
1
2
3
4
5
6
7
8
9
:
;
<
=
>
?
@
[
\
]
^
_
`
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
{
|
}
~
to
if
is
print
and
read
for
of
set
integer
long
else
with
exclusive
create
ans
increment
the
than
equal
by
int
declare
integers
from
let
size
newline
sum
new
array
be
inclusive
value
while
greater
loop
or
less
string
return
not
arr
line
cnt
then
true
length
input
max
in
no
decrement
10
min
function
res
do
increase
flag
assign
change
count
yes
modulo
num
add
variable
str
temp
break
following
s1
mod
as
false
end
s2
character
output
elements
one
result
element
vector
into
sort
ints
len
an
dp
arguments
ch
incrementing
first
equals
at
run
tmp
longs
values
standard
x1
##s
start
make
mx
variables
strings
absolute
boolean
gcd
char
maxn
t1
argument
call
it
x2
abs
returning
st
decrease
second
minimum
pos
constant
c1
mp
t2
index
y1
mn
even
called
append
100
##1
maximum
y2
total
are
##2
push
name
mid
cur
define
vis
stop
c2
ar
user
sum1
otherwise
arrays
insert
v1
now
last
that
decrementing
double
all
ok
bool
on
2d
check
ss
map
continue
1000
left
solve
p1
characters
sum2
a1
inf
right
##t
iteration
returns
1e9
void
p2
odd
maxx
n1
times
ret
each
105
counter
divide
subtract
n2
val
##d
swap
const
prime
space
##r
ans1
26
down
pointer
bitwise
##e
##l
12
taking
truthy
between
next
time
##a
tot
top
different
reading
get
ans2
a2
number
101
remove
minn
##0
s3
vec
casted
cost
row
up
##b
##c
dfs
beginning
##n
v2
where
xx
bytes
initialized
v0
20
find
back
begin
60
b1
out
11
both
##i
maxi
pre
##o
##p
empty
exit
##3
pair
position
##y
substring
takes
current
answer
cont
##m
cnt1
15
1000000007
two
curr
30
ma
sizeof
##4
mini
prev
##k
idx
max1
##x
display
cnt2
ara
d1
num1
plus
zero
p3
ct
show
dy
mark
aa
col
mi
aux
110
diff
power
fa
##er
1005
##h
base
k1
ith
unsigned
100000
pi
reverse
multiply
root
dist
step
f1
iterate
num2
m1
multiple
1ll
can
filled
l1
##g
id
square
d2
go
1001
cin
ind
mm
rest
str2
25
further
isprime
a3
word
31
count1
endline
np
order
f2
b2
dx
flag1
co
color
l2
m2
##f
nl
0x3f3f3f3f
rem
x3
day
digit
pow
using
##ed
str1
##ing
bb
found
friendship
ii
isn
k2
100005
tt
48
bitshift
getchar
sqrt
##u
data
r1
item
iterator
lcm
r2
starting
##5
##v
pq
test
fb
kol
50
dis
55
my
oo
rock
price
200
eps
bit
decremented
looping
lower
temp2
##es
erase
op
scissors
ta
temp1
cc
lo
min1
paper
impossible
10000
blue
cek
suma
360
clear
cmp
flag2
letter
segment
skip
score
win
yy
arr2
dif
chars
freq
mat
memset
sy
red
t3
180
##um
stream
sz
tb
##w
32
oooo
chest
hi
statement
arr1
inp
low
ac
ex
remainder
tc
##9
strlen
h1
minus
primes
sx
through
triangle
97
init
need
points
##7
high
upper
biceps
valid
250
fast
rows
setting
##8
ceil
queue
shift
type
1e
div
divided
move
until
green
inline
team
##al
##j
accepts
front
nn
store
terminate
vectors
vv
after
ascending
best
ms
##ion
dimensional
infinite
judge
ooo
sizes
unique
cout
keep
##count
count2
counting
dem
items
stdout
ai
sb
sol
txt
visited
##z
22
fill
rat
i1
mishka
which
coun
100001
adj
exp
minx
##in
##le
##num
correct
fabs
jj
kk
br
case
chris
ck
compare
contents
grid
joy
##ll
##ount
calling
gap
hh
i2
man
min2
point
precision
tie
u2
1e5
bs
c3
does
en
re
res1
resp
sumb
u1
ax
file
nums
##6
##ate
13
half
max2
tests
doubles
nothing
se
sign
##th
b3
booleans
cx
lol
open
pr
used
vasya
wins
cal
columns
days
fl
head
level
th
1000000
1000000000
anton
fixed
##et
ada
book
danik
misha
substr
tmp2
address
key
reference
sum3
three
##nt
cast
cn
graph
myset
pass
fuel
h2
qr
round
table
64
acos
father
good
invoke
pop
rd
s4
##q
black
ca
fi
home
proceed
akshat
chat
con
fathercnt
ignore
list
match
ru
way
yellow
##sum
16
bob
dep
distance
ff
fin
hitung
ll
magic
place
visit
##on
1e18
ehab
float
mahmoud
malvika
mult
tp
ty
##ck
cy
hash
ld
md
mind
ql
sm
##it
500
ay
counts
lu
maxm
orange
rounded
uneven
##ch
1e6
51
998244353
cs
ctr
ed
fact
has
initialize
mas
pp
squared
woman
##se
ad
board
captain
copy
dir
moves
res2
reset
same
sub
vs
write
y3
##00
1010
calc
child
dr
ncr
nx
##len
brr
keyboard
la
put
stack
tem
tm
turn
tx
args
cw
edges
ele
form
hate
increasing
li
med
min3
numbers
sc
##ar
##en
act
bits
ch1
pos1
respectively
xs
##ct
##os
big
bl
ccw
changing
cou
exist
falsy
incorrect
mymap
prog
returned
sieve
tmp1
whichposn
##an
##ly
##st
120
200000
edge
flg
positive
reality
sa
soul
white
winner
1000005
27
cp
dg
her
him
int64
its
maxa
multiplied
reduce
ys
##ce
##max
102
cap
decreasing
karen
ls
matches
modulus
mul
nonzero
priority
rs
sp
tam
##or
2e9
become
cube
guy
iter
lessons
na
oh
puts
rr
spf
starty
status
w1
w2
year
asd
depth
execute
game
howard
lim
masha
matrix
more
nb
penny
pos2
pref
purple
q1
val1
val2
##ans
0ll
2005
86400
ch2
cot
di
dp1
ds
leonard
love
month
rajesh
sheldon
var
xor
##int
18
contains
curlower
dasha
endl
fun
goal
gr
least
maxy
mina
num3
par
players
psum
pw
rlmoves
startx
sup
udmoves
x0
100010
21
24
240
28
chess
decimal
dest
fix
imax
lenb
pb
poly
side
tab
ti
tim
y0
##min
alpha
coins
containing
dd
every
having
lena
lucky
maxs
mode
money
ny
pa
rec
ri
state
##ute
201
cup
fx
goto
incremented
itr
menor
p4
program
register
su
##mp
1000000009
200001
alice
bi
bigger
bt
code
cycle
dodecahedron
dp0
jth
large
letters
lowercase
octahedron
pairs
send
sq
summ
tetrahedron
tstep
##ies
##io
##ow
et
hi2
lca
method
mxm
names
ori
qq
save
shu
sumr
ver
votes
was
##est
##ize
##time
200005
2001
5001
65
adding
bx
cd
ciel
f3
imin
infinitely
inlined
invert
label
le
ln
lt
men
minb
pointed
resize
seq
speed
sumc
tr
xb
##ad
##bs
##ne
##re
10000000
2000
220
96
aux2
cond
contador
dig
final
largest
light
lst
max3
n3
numops
pe
pl
req
there
too
vowel
weak
width
ya
##id
##nce
##ot
##ur
123
arra
aux1
bfs
cb
contest
dat
fy
g1
gl
icosahedron
j1
jump
marks
mx2
null
ones
rep
rx
stringstream
test1
undefined
ur
##10
##ation
##ew
##gers
##pos
##red
##str
##stream
##win
35
a4
answ
cntr
dc
dot
lc
len1
len2
minp
mx1
off
other
remaining
search
solution
v3
words
##ap
##ers
##ns
##ong
##prime
##ss
##ve
0th
36
ab
am
cnt3
dl
isp
levels
log
negative
present
prices
printing
rta
tolower
xay
xmax
xt
##array
##ke
##odd
##rr
##ts
##ty
##us
122
14
300
aj
area
bc
bn
command
ct1
del
diff2
discard
dos
gg
hanako
ini
miny
part
participants
pt
soroban
star
sumy
tar
uldr
weight
##ai
##arr
##as
##at
##ep
##mo
##mon
##per
##te
19
29
90
acosign
answers
arg1
buf
buff
cha
clo
clock
ct2
diff1
factor
getint
ios
ke
limit
maxlen
may
nd
nex
non
number1
number2
pd
plen
si
steps
sumx
sumz
ul
yb
yt
z1
zz
##am
##cost
##day
##is
##nd
##ng
##up
1st
501
ant
ar1
cad
condition
dim
es
interval
inv
maps
mmax
most
nor
numb
ope
pic
rc
rozdil
stdin
still
time1
time2
toggle
ts
vasilisa
wt
##gro
##gth
##hi
##il
##ind
##sort
##ut
10005
999999
active
bills
bk
bottles
cakes
cell
counta
deg
exe
ft
hang
hard
isvowel
jum
ki
mmin
mn2
mnm
post
record
sd
smaller
sr
work
xf
xsum
##its
##oi
##rd
##rt
1000006
150
1e10
2e5
alt
amount
ann
ara2
arg2
bulbasaur
carry
ci
cmd
comparator
crew
danil
divisor
dsa
easy
extra0
gets
ha
have
maxc
nikita
node
ns
olya
over
page
password
qaq
rt
salt
shifted
signed
slava
stones
str3
subtractions
tree
uppercase
vet
without
yf
ysum
##000
##ame
##eet
##ic
##ie
##ime
##ity
##ment
##moves
##olume
##oven
##pe
##ue
##ver
##ya
505
9999999
ajout
alph
ans3
beat
bottom
cards
decreased
distanc
error
ev
followed
gesture
getline
he
inch
indx
isgro
lb
lens
lines
matriz
maxv
mp1
pointers
pv
que
s0
sl
st1
st2
stone
tmo
vi
ways
xmin
ymax
ymin
##3f
##ance
##ber
##ding
##ger
##ical
##ka
##om
##one
##ra
##ri
##string
##uary
##ul
##ven
205
400
99999999
999999999
bound
box
colom
convert
done
el
endx
endy
ep
flaga
hasil
hotels
inputs
jumlah
kanan
leaf
lef
lj
lsum
mov
n0
n4
needtime
numa
parent
per
pole
possible
poww
prefix
q2
qua
rad
sh
short
slot
smallest
spec
sumd
suml
take
te
them
tot1
tot2
wp
zxcvbnm
##20
##ks
##mal
##mber
##number
##row
##ry
10001
111
17
23
600
99
acc
ant2
assigned
assigning
bear
bus
cn1
cnta
comp
computer
contiguous
cpy
diag
digits
elephant
fingers
fo
forward
frest
greatest
halfplus
inches
isdigit
larger
limak
log2
mxv
prepend
pro
qta
qtb
ry
tempm
toupper
tp1
usa
va
vest
worktime
xa
##alha
##ax
##ays
##found
##her
##hu
##ice
##ices
##iones
##ir
##ither
##par
##ps
##to
##ua
##uck
##ust
##wb
1000000009ll
1000001
1e8
a0
amt
angle
ansa
ansb
ats
bak
banyak
binary
bisa
bo
ce
cols
da
data2
ee
eight
fir
freopen
games
hb
inner
iterations
k3
koyomi
location
loct
maxj
mk
noop
nuts
person
pm
posy
prf
quotient
qwertyuiopasdfghjkl
raw
seg
so
su2
sw
t0
this
till
tri
##act
##ay
##code
##end
##ga
##gh
##ha
##ial
##ier
##me
##mn
##na
##o1
##oc
##ome
##pow
##sp
##umn
##value
10010
20000
52
999
a5
alien
ar2
bal
bin
bj
capital
cm
comparison
coord
criba
den
divis
drink
err
factorial
finall
gov
hash1
hash2
height
hello
hj
indefinitely
index1
lie
lzl
mask
maxcol
maxl
maxr
maxrow
maxsize
memo
minm
mins
ml
mn1
mo
nc
numver
oven1
palabra
palindrome
po
posx
pot
putchar
qmarks
sec
sums
tdiff
tempn
towels
tu
##ak
##counter
##ction
##dd
##dy
##el
##erator
##eric
##file
##impar
##iro
##ive
##letter
##lo
##mod
##o2
##ol
##square
##ta
##vl
##wo
##ze
1000003
1000010
5000
acum
alex
au
bacterias
byte
c0
c4
checker
chk
colors
commands
common
default
deq
divs
doit
dt
ey
fail
fastio
flog
four
fs
gh
grest
ihash
ite
ji
layer
lenght
locg
m3
map1
maxi2
maxnum
maxt
minincl
mt
neo
normal
nw
palin
permutation
prealoc
primos
ref
resta
sag
seed
sisa
siz
slogan
soldier
sss
suff
tabla
ten
third
tmpa
tp2
ud
ust
vm
voters
xy
zhuangtai
##0000
##able
##ack
##airs
##change
##ee
##ent
##ex
##ge
##ist
##ma
##nge
##od
##ours
##ox
##pointer
##pt
##r2
##reen
##rkecil
##ro
##root
##rs
##sn
##use
00
100000000
1000000007ll
2002
2nd
any
ap
before
cant
cmax
cntb
column
contain
ctx
cups
decrypt
delete
diag2
dimension
discounts
fans
fg
floor
foo
format
hor
infinity
iterating
itself
kh
kq
kt
leave
lett
liter
load
lr
lx
ly
maks
maxi1
medals
mp2
n7
nan
nike
nowp
npos
oven2
pairt
path
powmod
prevc
pri
ptr
query
raised
rm
satu
setprecision
slen
sorted
tank
target
timr
tims
tmpb
tol
un
ut
vn
wait
winc
xd
yd
##11
##ab
##ace
##ador
##ah
##are
##ba
##ble
##c1
##cal
##cases
##char
##cnt
##co
##color
##cusive
##gym
##if
##ik
##ination
##left
##nding
##ort
##ote
##presum
##ree
##rement
##sec
##tion
##tor
##tr
##tring
##un
100007
128
2ll
305
40
5005
57
9999999999
abc
aea
andd
ansf
app
asc
band
beginat
buffer
but
c5
candidate
cans
cdays
cel
che
check1
cnt4
cnt7
cont2
cost1
cost2
cr
curans
data1
data3
denominator
desk
dua
encontrado
extra0max
fim
flareon
floats
g2
going
gs
hn
inff
initial
ix
jmax
jmin
jumlahgenap
kkk
linf
llong
main
maxcnt
mc
mintime
modexp
msum
nadj
nas
nearest
ngh
numberofelements
numedges
oil
pause
people
pet
previous
process
prohibited
ra
random
rb
rla
rn
seen
sets
sg
sml
smr
sn
ssum
step1
strcmp
stripe
strr
swapped
sylveon
sz1
tag
text
umbreon
##3f3f
##3f3f3f
##47
##all
##ates
##blems
##cc
##contest
##d1
##dc
##ef
##even
##fe
##ff
##gos
##imon
##je
##la
##les
##name
##nut
##ones
##our
##oy
##point
##right
##same
##ter
##tin
##ting
##ung
##unt
##vator
##vel
##ward
##word
1000000001
1100
3000
47
99999
a6
ansm
ansx
ant1
arg
ba
biao
biggest
block
boxes
capacity
ccnt
ck1
comp2
content
converted
coty
des
desperate
dp2
dq
face
fff
friends
fuck
gc
getans
glaceon
gp
hangx
highest
huruf
ifstream
input1
ip
iso
istrue
jarak
jolteon
leafeon
lf
lin
loser
lowest
matching
maxcount
maxsum
merge
midtime
mini1
mini2
modd
multiplying
nama
niz
nok
nr
nt
occ
optimization
p9
pas
piso
pwr
px
qpow
r3
rides
rprev
sheets
shengyu
stat
sym
taken
team1
towards
vec1
walk
welfare
xl
xxx
ye
zsum
##a1
##ale
##and
##bi
##bles
##c2
##cluisve
##clusive
##ds
##eat
##ec
##em
##f3f3f3f
##fffffff
##ft
##gas
##gcd
##hen
##iff
##ii
##ine
##ix
##ln
##ntity
##oric
##players
##py
##set
##t1
##ted
##thing
##times
##tn
##ttle
##ual
##ush
##uy
##votes
##wen
##zeros
100002
1ull
9999
always
bigmod
bst
bul
busca
charnum
choc
choose
cmn
cmx
cn2
cntc
consecutive
conv
countb
counter1
counter2
creates
cut
de
degree
deque
differ
difference
disc
dist1
duplicates
eaten
elv
factors
findfa
finite
fj
fla
flat
fpow
gla
ho
horizontal
incremen
inicial
inve
isalpha
ish
j2
jol
jumlahganjil
jumps
loss1
loss2
map2
maxexcl
memory
mima
minn2
mint
minval
modpow
mybak
ne
newsum
nextprime
nimpar
nom
npar
nsp
num4
num7
numero
o1
o2
od
old
pangkat
pc
pen
percolor
posiciones
prim
qclose
rank
rl
rl1
rl2
sandali
say
shelves
soma
static
suck
suf
syl
t01
team2
term
transform
umb
vl
we
wrong
x4
xorr
xr
##!
##"
###
##$
##%
##&
##'
##(
##)
##*
##+
##,
##-
##.
##/
##:
##;
##<
##=
##>
##?
##@
##[
##\
##]
##^
##_
##`
##{
##|
##}
##~
