[PAD]
[UNK]
[START]
[END]
!
"
#
$
%
&
'
(
)
*
+
,
-
.
/
0
1
2
3
4
5
6
7
8
9
:
;
<
=
>
?
@
[
\
]
^
_
`
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
{
|
}
~
int
if
cout
cin
for
long
endl
return
else
ans
main
while
sum
string
arr
size
max
min
cnt
break
10
no
char
yes
res
flag
str
count
num
temp
s1
true
abs
bool
s2
push
false
sort
vector
back
length
dp
ch
const
len
end
begin
mod
tmp
x1
gcd
maxn
mx
continue
t1
x2
st
void
second
mp
pos
t2
100
y1
##s
first
c1
mn
double
y2
sizeof
it
##1
vis
memset
ar
mid
##2
cur
total
v1
c2
insert
1000
sum1
map
now
ss
ok
check
solve
p1
set
puts
find
a1
getchar
1e9
result
105
sum2
p2
n1
maxx
index
swap
inf
26
last
n2
prime
##t
ret
val
left
12
counter
strlen
input
101
getline
ans1
in
substr
name
start
##l
vec
a2
dfs
tot
ans2
right
s3
row
v2
minn
##e
##d
time
20
xx
60
pair
11
v0
and
sqrt
top
##r
cost
##a
##b
b1
number
##0
##o
15
maxi
30
##p
##c
1000000007
erase
cnt1
##n
curr
ma
unsigned
##3
pre
ceil
answer
cont
110
ara
mini
d1
max1
read
##4
idx
pop
prev
##x
p3
##i
1005
num1
col
##y
is
mark
100000
pow
up
clear
cnt2
1ll
ct
ii
mi
fa
aa
diff
aux
1001
new
dist
reverse
base
k1
f1
num2
##m
d2
l1
out
str2
dy
0x3f3f3f3f
l2
word
ind
m1
mm
empty
isprime
31
iterator
at
np
str1
id
power
a3
f2
b2
nl
color
flag1
##g
step
100005
25
x3
##k
day
rem
##er
48
print
friendship
200
one
down
inline
m2
##h
count1
50
bb
pi
output
dx
k2
55
lcm
10000
co
tt
##f
my
fb
found
##5
r1
rock
data
price
cmp
scissors
##v
impossible
op
paper
r2
ta
test
360
pq
temp1
blue
cc
min1
temp2
an
dis
value
kol
oo
segment
##u
32
cek
get
mat
flag2
win
tc
yy
180
arr2
freq
##ed
lo
suma
t3
dif
inp
red
sy
int64
oooo
tb
or
score
gets
arr1
fabs
primes
chest
##w
97
ac
next
strcmp
ex
low
triangle
1e
eps
hi
init
h1
sx
sz
250
fast
exit
front
need
##7
acos
green
vv
biceps
jj
team
##8
##es
array
high
position
##9
ms
ooo
##um
div
i1
ignore
judge
line
queue
to
##count
ai
best
current
rat
txt
make
nn
##ll
22
visited
100001
dem
mishka
1000000
1e5
count2
element
sb
correct
man
nums
sol
##num
adj
float
grid
u1
u2
chris
fixed
joy
pr
tie
tolower
digit
kk
minx
13
ax
br
do
en
i2
used
##z
ck
gap
level
points
se
##6
b3
coun
min2
upper
##j
add
max2
wins
bs
cx
hh
vasya
book
c3
cal
can
exp
goto
head
##ount
fl
misha
resp
1000000000
51
anton
danik
myset
odd
ada
graph
letter
putchar
res1
sumb
two
days
h2
table
1e18
even
good
lol
qr
rd
s4
tmp2
father
fi
home
register
akshat
black
itr
list
re
ru
store
valid
yellow
freopen
magic
tests
visit
way
##q
16
1e6
ca
chat
cn
con
ed
ehab
fin
ll
mahmoud
malvika
pass
precision
ty
##sum
1010
500
ay
bob
ff
hash
ld
ql
times
woman
zero
##al
captain
child
cy
fact
fuel
lu
mas
match
orange
##on
200000
998244353
fathercnt
md
mind
sub
all
as
dep
pos1
rest
space
y3
board
calc
counts
dir
distance
strcpy
sum3
vs
##00
##et
##ion
##le
act
brr
ctr
hate
isdigit
iter
lower
ncr
tem
tx
##len
##time
cw
exist
from
maximum
min3
moves
mult
nx
pp
resize
that
toupper
tp
unique
##an
##ate
compare
dr
ele
greater
li
maxm
res2
sm
xs
120
ad
ccw
ch1
cs
edges
incorrect
mymap
pos2
prog
sieve
##est
##ing
0ll
27
half
la
med
reality
root
sc
soul
tm
ys
##it
##or
##se
1000005
201
2e9
big
dg
her
him
rs
sa
stack
whichposn
white
with
##ch
##en
102
bl
cap
cp
edge
hitung
item
karen
key
ls
priority
the
turn
become
cou
cube
guy
keyboard
lessons
maxa
nb
oh
sign
sp
spf
status
w1
w2
winner
year
##ans
flg
game
howard
lena
numbers
penny
purple
startx
starty
##ar
##nt
2005
86400
asd
cot
leonard
lim
love
masha
month
players
pref
rajesh
setprecision
sheldon
tam
tmp1
##in
28
di
dp1
fun
go
goal
gr
matches
mina
mul
na
num3
psum
side
x0
100010
21
24
240
ch2
change
chess
curlower
dasha
has
par
poly
q1
rlmoves
rr
sup
udmoves
var
y0
##ct
5001
alpha
equal
fill
imax
log
move
pa
pb
qq
tab
val1
200001
2001
coins
dest
ios
items
lenb
lucky
ori
p4
state
three
val2
##min
##os
##st
18
35
65
alice
bi
bt
cycle
dat
dd
dodecahedron
fx
j1
lca
maxs
maxy
money
ny
octahedron
rec
su
tetrahedron
##max
##mp
##ss
##us
1000000009
by
dp0
ds
et
fix
hi2
mxm
pw
seq
summ
ti
2000
200005
bfs
bit
bx
ciel
cup
f3
letters
men
of
shu
signed
stdin
stringstream
tim
ver
##ck
501
contador
file
max3
menor
minb
n3
names
npos
open
pl
plus
sq
too
type
votes
weak
xb
##bs
##int
##ow
10000000
220
96
arra
cb
contest
final
gl
icosahedron
le
lst
lt
point
remainder
save
sumc
sumr
ur
122
123
cd
clock
dig
floor
fy
g1
light
ln
marks
mx1
setf
v3
words
ya
##ad
##cal
##ep
##rr
14
300
36
90
aux2
dl
dot
imin
lc
levels
minimum
mx2
ones
pe
prices
rep
req
rx
speed
test1
tr
xay
##ic
##pos
##prime
##up
##ur
999999
ab
aj
answers
aux1
bound
chars
cnt3
colom
dc
dim
hanako
isp
off
participants
ri
rta
short
soroban
star
tar
uldr
undefined
was
xt
yt
##ai
##ize
##ne
##win
a4
am
answ
area
arg1
bc
bn
bus
del
diff1
diff2
getint
hang
inv
isvowel
maxlen
minp
number1
number2
pd
record
rows
solution
vasilisa
weight
xmax
##arr
##mo
##ong
##rd
1000006
10005
400
bal
bk
buf
cad
cell
cha
clo
cntr
command
dos
factor
gg
ini
may
mp1
numops
ope
pic
rozdil
sd
square
stdout
still
time2
toggle
tstep
ul
##ation
##day
##impar
##om
##str
##te
##ut
19
205
2e5
ajout
ar1
arg2
bills
both
buff
crew
deg
ha
hard
ke
ki
len1
len2
matriz
miny
mmax
mnm
nex
pt
rc
rt
str3
time1
ts
vet
vi
wt
z1
zz
##ap
##ew
##gro
##ity
##ka
##nce
1000001
150
1e10
29
505
ann
ara2
atoi
carry
cerr
cmd
cond
danil
depth
easy
isgro
log2
nikita
node
olya
password
present
rbegin
si
slava
st1
stones
subtractions
sumx
sumy
tree
work
xf
yb
yf
##ame
##d1
##ers
##moves
##ns
##ves
210
9999999
99999999
active
ant
beat
bulbasaur
ci
counta
ct1
distanc
ft
gesture
isalpha
isupper
jum
kanan
large
lb
maxc
mmin
mn2
nd
numb
on
page
parent
post
pv
qaq
que
salt
sl
st2
stone
values
##ce
##el
##id
##me
##per
##ra
##string
10001
111
5000
999999999
alt
bin
bottom
cakes
cn1
comp
computer
ct2
dsa
el
endx
endy
es
exe
extra0
fail
frest
he
inch
interval
lef
limit
lj
lsum
minus
nor
ns
plen
pole
poww
q2
qua
remaining
sh
spec
sr
sumz
tmo
xsum
ysum
zxcvbnm
##10
##gth
##ng
##ps
##ri
##th
23
600
alph
amount
ans3
bear
bottles
cards
diag
elephant
ep
ev
flaga
halfplus
hasil
have
hotels
inches
ite
leaf
lens
loct
mask
maxv
mxv
n4
per
posx
prefix
qta
qtb
s0
static
te
tot1
tot2
va
vest
vowel
wp
write
xmin
ymax
ymin
##3f
##as
##at
##cost
##ee
##hu
##iones
##mod
##mon
##olume
##one
##oven
##sort
##ua
##ute
##ver
1000000009ll
17
1e8
52
999
a0
amt
angle
ant2
banyak
be
bisa
bj
bo
box
c0
cnta
contiguous
coord
criba
data2
divisor
done
games
hb
height
indx
jumlah
koyomi
lie
numa
palindrome
permutation
posy
qwertyuiopasdfghjkl
raw
rend
sec
seg
strstr
suml
tempm
tp1
tri
xa
##20
##ance
##code
##ga
##ha
##io
##ke
##na
##ome
##par
##pow
##rt
##set
##ts
##ue
##value
##ven
##wb
10010
20000
2002
64
acc
alien
append
ar2
bacterias
bak
cols
divs
drink
ee
eight
err
factorial
fingers
gov
hello
hj
hn
limak
liter
locg
maxsize
memo
mk
mn1
mode
n0
nc
numver
palabra
pointer
pro
slot
sorted
sss
su2
sumd
sums
tu
ways
##ator
##ay
##end
##found
##letter
##ment
##nd
##number
##ort
##ot
##ta
##uck
1000000007ll
2ll
99
a5
alex
andd
ansf
ats
au
c4
ce
cel
check1
checker
chk
colors
da
den
deq
discounts
divis
doit
dt
fastio
finall
flog
grest
ihash
index1
kt
layer
llong
m3
map1
maxj
maxl
maxnum
ml
mov
mp2
nuts
nw
pairt
palin
person
po
possible
pot
prealoc
primos
qmarks
ref
ry
same
send
slogan
soldier
steps
sw
tabla
tdiff
tempn
usa
ut
vm
##000
##ction
##dd
##ents
##fe
##ft
##il
##o1
##o2
##od
##odd
##of
##our
##ours
##py
##rkecil
##ty
##ul
100000000
1000010
3000
40
ansa
ansb
cans
cmax
ctx
decrypt
deque
diag2
foo
fs
gh
ji
kq
lett
lines
load
location
lzl
maks
maxcol
maxi2
maxr
maxrow
maxt
minm
mins
mo
mole
nan
neo
nike
normal
not
null
oven1
path
pm
powmod
query
remove
resta
run
siz
so
t0
target
timr
ud
un
vn
xy
zhuangtai
##0000
##ador
##alha
##ase
##ba
##cases
##color
##der
##eek
##ena
##ff
##ik
##ln
##ma
##mn
##ote
##r2
##sec
##sp
##stream
##to
##wo
##xc
##ya
00
305
47
5005
57
9999999999
abc
app
asc
c5
cdays
cm
cntb
commands
comp2
coty
cr
data1
data3
des
encontrado
extra0max
ey
fans
fg
fj
gs
hangx
hor
ifstream
islower
ix
jumlahgenap
maps
maxcnt
maxi1
minincl
modexp
modulo
mt
n7
nas
nowp
numberofelements
numedges
pause
people
prevc
prf
pri
rb
rem1
rl1
rl2
rla
rm
sag
satu
search
seen
sg
showpoint
sisa
slen
sn
ssum
stop
strr
suff
swapped
taken
tims
tmpa
tmpb
tol
towels
tp2
transform
ust
voters
wait
welfare
winc
worktime
xd
yd
##ab
##ack
##ah
##blems
##c1
##cc
##cks
##co
##contest
##counter
##dy
##ent
##gym
##her
##hi
##ier
##ies
##ile
##its
##je
##ks
##la
##left
##mes
##name
##nut
##oints
##ol
##oy
##pointer
##right
##ro
##square
##tin
##tor
##unc
##vl
##ze
1000000001
1000003
100007
1007
1100
128
4000
80
99999
assert
band
biao
binary
candidate
cant
cn2
cnt4
cnt7
cost1
cost2
countb
cpy
curans
desk
desperate
digits
dp2
dua
fff
fim
flareon
fpow
friends
function
getans
glaceon
hash1
hash2
huruf
input1
ip
jarak
jmax
jmin
jolteon
k3
kh
kkk
leafeon
lf
loop
loser
lr
lx
ly
mc
modd
msum
nama
ne
nextprime
niz
nok
occ
oil
optimization
orgstr
oven2
piso
prohibited
ptr
pwr
px
qpow
seed
sheets
stat
step1
sylveon
sym
tag
team1
text
towards
umbreon
user
vec1
walk
xl
xorr
xxx
ye
##32
##47
##a1
##ec
##ets
##gcd
##ial
##ime
##ir
##ive
##ly
##ntity
##oric
##players
##presum
##re
##root
##sn
##sos
##t1
##tc
##tring
##un
##ung
##uy
##vator
##vel
##votes
##zeros
100002
100009
1111
1ull
9999
a6
ansx
ant1
ap
ba
beginat
bigmod
boox
bst
buffer
busca
capacity
ccnt
che
ck1
cmn
cmx
cntc
conv
cups
currnum
degree
differ
doc
eaten
factors
findfa
finite
fir
fn
four
g2
gc
gp
horizontal
inicial
inve
ipos
ish
iso
istrue
j2
jumlahganjil
largest
least
map2
maxcount
maxsum
medals
mima
mini1
mini2
mint
modpow
more
mybak
nadj
needtime
ngh
nom
nr
nsp
numero
ostringstream
other
p9
pangkat
part
pc
pen
percolor
posiciones
prim
profits
qclose
quotient
r0
ra
rank
reading
rfind
rides
rl
rn
rprev
sandali
sheet
shengyu
sml
smr
soma
stripe
suck
sz1
t01
take
tank
team2
vb
vl
ww
x4
zsum
##and
##anges
##ates
##bi
##c2
##cess
##char
##cnt
##ding
##ear
##em
##even
##gos
##hack
##home
##ide
##iff
##ii
##imon
##ist
##iv
##iwen
##ls
##lumn
##mal
##mind
##ndex
##nts
##oes
##oi
##rs
##t2
##ttle
##uest
##umn
##unt
##ve
##ward
10000000000
1002
200010
5002
81
acef
acum
ansm
april
aq
arr3
arrb
august
before
bitset
block
blocka
blu
blyat
boxes
brainfuck
bul
cast
cei
characters
checkodd
choc
choose
cities
city
cntfloat
coin
column
cont2
counter1
counter2
cprice
csx
curind
cut
cz
de
denominator
dict
difference
disc
divisores
dm
eevee
encrypt
exam
fac
february
fla
flat
foot
free
gcdofarray
gla
ho
holidays
hush
ids
inff
infinite
january
jjj
jol
july
june
kmax
ky
larger
lft
lin
loss1
loss2
malloc
march
mass
maxk
maxval
me
merge
mi2
mi3
mindis
minmum
minn2
minr
mintime
minute
minval
mn3
modi
mohi
nam
nearest
norm
november
numpairs
nxt
october
od
odds
ofstream
old
ops
outfile
passengers
patt
phonearray
posibles
ppow
qy
r3
ratio
ratios
reduce
remove0
righ
rot
say
seive
sel
september
shapes
sk
slice
small
spyke
spykeid
start1
stck
syl
ten
texto
timer
tipe
trump
umb
v4
valori
wa
wrong
xr
yelo
zerosones
ziro
##!
##"
###
##$
##%
##&
##'
##(
##)
##*
##+
##,
##-
##.
##/
##:
##;
##<
##=
##>
##?
##@
##[
##\
##]
##^
##_
##`
##{
##|
##}
##~
